#!/usr/bin/env python
#coding:utf-8

DB_CFG = {
    "host":"10.182.21.52",
    "user":"root",
    "password":"root",
    "port":3300,
    "db":"db_ticket_system"
}

STATUS_NAME_CFG = {
    0:"未处理",
    1:"处理中",
    2:"已结单",
    3:"待补充",
    4:"已关闭",
}

#状态转换配置
STATUS_CHG_CFG = {
    0:[4, 3, 1, 0],
    1:[4, 2, 1],
    2:[2],
    3:[0,3, 4],
    4:[4]
}

#状态权限配置
#按位操作,  结单, 关闭, 评论, 编辑
STATUS_AUTH_CFG = {
    0:0b0101, #未处理，可关闭，可编辑
    1:0b1110, #处理中，可结单，可关闭，可评论
    2:0b0000, #已结单
    3:0b0101, #待补充，可关闭，可编辑
    4:0b0000, #已关闭
}
